<?php
return [
    'auth' => [
        //RBAC权限相关--
        'super_auth_adm'            =>'admin,cui',  // 超级管理员账号列表 多个用,分开
        'user_auth_nodes'           =>'user_nodes', //session存`放用户权限节点的名
        'no_auth_controller'       =>'index', //默认无需验证的控制器
    ],
//    'application' => [
//        0 => '申请中',
//        1 => '已通过',
//        -1 => '已驳回',
//    ],
//    'dba' => [
//        0 => '上线中',
//        1 => '已经上线',
//    ],
//    'extension_duration' => [
//        0 => '3个月',
//        1 => '半年',
//        2 => '一年',
//        3 => '两年',
//        4 => '三年',
//        5 => '五年',
//    ],
//    'active' => [
//        1 => '启用',
//        0 => '禁用',
//    ],
//    'store' => [
//        1 => '营业中',
//        0 => '已停业',
//    ],
];