<?php

return [
    'normal' => [1 => '正常', -1 => '禁用'],
    'switch' => [1 => '是', -1 => '否'],
    'course' => [1 => '正常', -1 => '停课'],
    'verify' => [0 =>'申请中',1 => '批准', -1 => '驳回'],
    'payout' => [0 => '申请中', 1 => '已批准', 2 => '已支付', -1 => '驳回'],
    'gender' => [1 => '男', 2 => '女', 0 => '保密'],
    'role' => [1 => '学生', '妈妈', '爸爸', '爷爷', '奶奶', '姥姥', '姥爷', '其他'],
    'case' => [0 => '待审核', 1 => '已发布', -1 => '审核不通过'],
    'case_agent' => [0 => '申请中', 1 => '已同意', -1 => '已拒绝', -2 => '已取消'],
    'court_level' => [1 => '初级法院', 2 => '中级法院', 3 => '高级法院', 4 => '最高法院'],
    'lawyer_grade' => [1 => '一级律师', 2 => '二级律师', 3 => '三级律师', 4 => '四级律师'],
    'ad_position' => ['h5_bottom' => '移动端底部', 'h5_banner' => '移动端Banner'],
    'message_way' => [0 => '站内消息', 1 => '短信', 2 => '邮件', 3 => '公众号提醒'],
    'weekdays' => [1=>'周一', '周二', '周三', '周四', '周五', '周六','周日' ],
];
